[
  {
    "title": "What the Marquise Goodwin signing means for Bears’ draft plans",
    "description": "The Chicago Bears added some depth to their receivers room with the signing of veteran wideout Marquise Goodwin to a one-year deal + The Bears have a glaring need at the wide receiver position behind Allen Robinson and Darnell Mooney",
    "imageUrl": "https://bearswire.usatoday.com/wp-content/uploads/sites/63/2021/04/MarquiseGoodwin_signed.png?w=640",
    "newsType": "sports"
  },
  {
    "title": "Jazz star Donovan Mitchell helped off floor after suffering ankle sprain vs. Pacers",
    "description": "Utah Jazz star Donovan Mitchell suffered what looked like a rough ankle injury on Friday afternoon, but avoided the worst-case scenario.We hope that it's nothing serious, but they're in the process of doing everything they can to assess that, Jazz coach Quin Snyder said",
    "imageUrl": "https://www.sportsnet.ca/wp-content/uploads/2021/04/donovan-mitchell-jazz-injury-1-1040x572.jpg",
    "newsType": "sports"
  },
  {
    "title": "Celtics sign Jabari Parker to 2 year deal, waive Mo Wagner",
    "description": "Jabari Parker -- the former No. 2 overall pick -- has agreed to a two-year deal with the Celtics, sources said. Parker, a career 14.8 points per game scorer, gives Boston some depth in frontcourt.",
    "imageUrl": "https://s.yimg.com/ny/api/res/1.2/lR2xrKobnzH.1EKyemctVQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTIwMDA7aD0xMzMz/https://s.yimg.com/os/creatr-images/2020-04/1bdebec0-7480-11ea-9fff-35328ec48e13",
    "newsType": "sports"
  },
  {
    "title": "Jimmy Garoppolo trade destination rankings as 49ers' draft decision nears",
    "description": "Whether the 49ers draft Justin Fields, Mac Jones or Trey Lance, it's clear that Jimmy Garoppolo doesn't have a long-term future with the 49ers. Garoppolo is, for now, expected to be the starter in 2021 before the 49ers pass the torch to whoever coach Kyle Shanahan hand selects to be the trigger man for his offense",
    "imageUrl": "https://www.nbcsports.com/sites/rsnunited/files/styles/article_video_thumbnail/public/short_form_video/hero/4-7_49ers_Talk_mock_draft_Fields.jpg",
    "newsType": "sports"
  }
]
